// 메소드(method) : 명령문들의 묶음, 동작(행위)의 단위
// main 메소드 - 반드시 1개만 존재, 모든 명령의 시작과 끝을 담당함

// 주석(Comment)
// 1. 주석의 목적: 기능에 대한 설명, 여러 가지 기능의 테스트를 할 목적
// 2. 주석의 방법: 한줄 주석(//), 여러줄(범위) 주석(/* ... */)

// 괄호
// [] : 배열
// {} : 범위
// () : 메소드 호출

// ; (세미콜론) : 하나의 문장의 끝

// 실행(Run) - 단축키: Ctrl + F11
public class Test01 {
    public static void main(String[] args) {
        // 출력 메소드
        // println: 줄바꿈 출력 메소드
    	
        System.out.println("자바를 공부하고 있습니다.");
        System.out.println("처음 시작하는 자바 프로그램.");
    }
}
